In [1]:
import pandas as pd
import numpy as np
ser = pd.Series(range(5), index=list("abcde"))

ser.loc[["a", "c", "e"]]

a    0
c    2
e    4
dtype: int64

In [2]:
df = pd.DataFrame(np.arange(25).reshape(5, 5), index=list("abcde"), columns=list("abcde"))

df.loc[["a", "c", "e"], ["b", "d"]]

    b   d
a   1   3
c  11  13
e  21  23

In [3]:
dates = pd.date_range('1/1/2000', periods=8)

df = pd.DataFrame(np.random.randn(8, 4),
                  index=dates, columns=['A', 'B', 'C', 'D'])

df

                   A         B         C         D
2000-01-01  1.041917  1.203960  2.233298 -0.276528
2000-01-02 -1.695957 -2.083071 -0.212644 -0.910953
2000-01-03  0.855435  1.172846  2.078240  0.609705
2000-01-04 -0.203120  0.020476 -0.900161 -0.308050
2000-01-05  1.086433 -0.500985 -1.120770  0.762896
2000-01-06  0.709335 -1.360979  0.737383  0.873384
2000-01-07 -0.024675 -0.850337 -1.647623 -0.000226
2000-01-08  0.786271 -0.231214 -0.768416 -1.694455

In [4]:
s = df['A']

s[dates[5]]

np.float64(0.7093349496430663)

In [5]:
df[['B', 'A']] = df[['A', 'B']]

df

                   A         B         C         D
2000-01-01  1.203960  1.041917  2.233298 -0.276528
2000-01-02 -2.083071 -1.695957 -0.212644 -0.910953
2000-01-03  1.172846  0.855435  2.078240  0.609705
2000-01-04  0.020476 -0.203120 -0.900161 -0.308050
2000-01-05 -0.500985  1.086433 -1.120770  0.762896
2000-01-06 -1.360979  0.709335  0.737383  0.873384
2000-01-07 -0.850337 -0.024675 -1.647623 -0.000226
2000-01-08 -0.231214  0.786271 -0.768416 -1.694455

In [6]:
df[['A', 'B']]

                   A         B
2000-01-01  1.203960  1.041917
2000-01-02 -2.083071 -1.695957
2000-01-03  1.172846  0.855435
2000-01-04  0.020476 -0.203120
2000-01-05 -0.500985  1.086433
2000-01-06 -1.360979  0.709335
2000-01-07 -0.850337 -0.024675
2000-01-08 -0.231214  0.786271

In [8]:
df.loc[:, ['B', 'A']] = df[['A', 'B']]
df[['A', 'B']]

                   A         B
2000-01-01  1.203960  1.041917
2000-01-02 -2.083071 -1.695957
2000-01-03  1.172846  0.855435
2000-01-04  0.020476 -0.203120
2000-01-05 -0.500985  1.086433
2000-01-06 -1.360979  0.709335
2000-01-07 -0.850337 -0.024675
2000-01-08 -0.231214  0.786271

In [10]:
#Swapping column values using raw values
df.loc[:, ['B', 'A']] = df[['A', 'B']].to_numpy()
df[['A', 'B']]

                   A         B
2000-01-01  1.203960  1.041917
2000-01-02 -2.083071 -1.695957
2000-01-03  1.172846  0.855435
2000-01-04  0.020476 -0.203120
2000-01-05 -0.500985  1.086433
2000-01-06 -1.360979  0.709335
2000-01-07 -0.850337 -0.024675
2000-01-08 -0.231214  0.786271

In [12]:
df.iloc[:, [1, 0]] = df[['A', 'B']]
df[['A','B']]

                   A         B
2000-01-01  1.041917  1.203960
2000-01-02 -1.695957 -2.083071
2000-01-03  0.855435  1.172846
2000-01-04 -0.203120  0.020476
2000-01-05  1.086433 -0.500985
2000-01-06  0.709335 -1.360979
2000-01-07 -0.024675 -0.850337
2000-01-08  0.786271 -0.231214

In [14]:
#Accessing an index on a Series or column on a DataFrame directly as an attribute
sa = pd.Series([1, 2, 3], index=list('abc'))
dfa = df.copy()
sa.b

np.int64(2)

In [15]:
dfa.A

2000-01-01    1.041917
2000-01-02   -1.695957
2000-01-03    0.855435
2000-01-04   -0.203120
2000-01-05    1.086433
2000-01-06    0.709335
2000-01-07   -0.024675
2000-01-08    0.786271
Freq: D, Name: A, dtype: float64

In [16]:
sa.a = 5
sa

a    5
b    2
c    3
dtype: int64

In [17]:
dfa.A = list(range(len(dfa.index)))  # ok if A already exists
dfa

            A         B         C         D
2000-01-01  0  1.203960  2.233298 -0.276528
2000-01-02  1 -2.083071 -0.212644 -0.910953
2000-01-03  2  1.172846  2.078240  0.609705
2000-01-04  3  0.020476 -0.900161 -0.308050
2000-01-05  4 -0.500985 -1.120770  0.762896
2000-01-06  5 -1.360979  0.737383  0.873384
2000-01-07  6 -0.850337 -1.647623 -0.000226
2000-01-08  7 -0.231214 -0.768416 -1.694455

In [18]:
dfa['A'] = list(range(len(dfa.index)))  # use this form to create a new column
dfa

            A         B         C         D
2000-01-01  0  1.203960  2.233298 -0.276528
2000-01-02  1 -2.083071 -0.212644 -0.910953
2000-01-03  2  1.172846  2.078240  0.609705
2000-01-04  3  0.020476 -0.900161 -0.308050
2000-01-05  4 -0.500985 -1.120770  0.762896
2000-01-06  5 -1.360979  0.737383  0.873384
2000-01-07  6 -0.850337 -1.647623 -0.000226
2000-01-08  7 -0.231214 -0.768416 -1.694455

In [19]:
#Slicing ranges
s[:5]

2000-01-01    1.041917
2000-01-02   -1.695957
2000-01-03    0.855435
2000-01-04   -0.203120
2000-01-05    1.086433
Freq: D, Name: A, dtype: float64

In [20]:
s[::2]

2000-01-01    1.041917
2000-01-03    0.855435
2000-01-05    1.086433
2000-01-07   -0.024675
Freq: 2D, Name: A, dtype: float64

In [21]:
s[::-1]

2000-01-08    0.786271
2000-01-07   -0.024675
2000-01-06    0.709335
2000-01-05    1.086433
2000-01-04   -0.203120
2000-01-03    0.855435
2000-01-02   -1.695957
2000-01-01    1.041917
Freq: -1D, Name: A, dtype: float64

In [22]:
df[:3]

                   A         B         C         D
2000-01-01  1.041917  1.203960  2.233298 -0.276528
2000-01-02 -1.695957 -2.083071 -0.212644 -0.910953
2000-01-03  0.855435  1.172846  2.078240  0.609705

In [28]:
df[2::-1]

                   A         B         C         D
2000-01-03  0.855435  1.172846  2.078240  0.609705
2000-01-02 -1.695957 -2.083071 -0.212644 -0.910953
2000-01-01  1.041917  1.203960  2.233298 -0.276528

In [ ]:
#Selection by label